# GetPolyloop Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetPolyloop Method
EnergyAnalysisSurface Class See Also
---
Gets the planar polygon describing the surface geometry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Polyloop GetPolyloop()
```

Visual Basic
---
```text
Public Function GetPolyloop As Polyloop
```

Visual C++
---
```text
public:
Polyloop^ GetPolyloop()
```

# ### Return Value
The planar polygon describing the surface geometry.
# Remarks
A planar polygon describing the surface geometry as described in gbXML. The geometry is currently measured per analytical(center-line).
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace